Org-Grimoire.org
#+title: Org-Grimoire
#+PROPERTY: tangle yes

* Introduction

  Trying to keep my org-mode setup inside of the Emagicians Starter
  Kit was getting too insane.  On top of that I declared
  org-bankruptcy awhile ago, and haven't really recovered since.  And
  so, here is a fresh new attempt at using org.  Along with it will be
  a tutorial that anyone can follow along with and get themselves into
  a better state.

* How to use this Guide

  Not sure yet. Wait till it is written.

* Org fixing - all the small things that need tweaking
** Saveplace
#+begin_src emacs-lisp 
(defun emagician-org/fix-saveplace ()
    "Fixes a bit of brokenness with saveplace.el and org-mode"
    (when (outline-invisible-p)
      (save-excursion
        (outline-previous-visible-heading 1)
        (org-show-subtree))))
  
  (add-hook 'org-mode-hook 'emagician-org/fix-saveplace)
#+end_src

** Turn on flyspell
#+begin_src emacs-lisp 
  (add-hook 'org-mode-hook 'flyspell-mode)
#+end_src

** Fix YAS
     The latest version of yasnippet doesn't play well with Org mode.
     If the above code does not fix the conflict, start by defining the
     following function:
#+begin_src emacs-lisp 
(defun yas/org-very-safe-expand ()
  (let ((yas/fallback-behavior 'return-nil)) (yas/expand)))
#+end_src

     Then, tell Org mode what to do with the new function:
#+begin_src emacs-lisp 
(emagician/defhook fix-yasnippet-for-org org-mode-hook
  (make-variable-buffer-local 'yas/trigger-key)
  (setq yas/trigger-key [tab])
  (add-to-list 'org-tab-first-hook 'yas/org-very-safe-expand)
  (define-key yas/keymap [tab] 'yas/next-field))
#+end_src

* What do I need. 

  - Basic Todo Listing and entry 
    - Grouping of tasks under a project
	- Tasks Have states: TODO, NEXT, WAITING and DONE.
	- Show all Next Actions 
  - Pomodoro
	- Timers
  - Journaling and time management
	- Prompt for when tasks change state
	- show time spent on a task.
  - Habits For Review
  - Agendas
  - Quick access to org files
  - Sane attachment handling (link to, not copy)
* Agenda Files
#+begin_src emacs-lisp 
(setq org-agenda-files '("~/org/" "~/Dropbox/arduino/BunnyCyborg/BunnyCyborg.org" "~/Dropbox/Creativity/Site3.0/Site.org"))
#+end_src

* TODOs 
** Start with states.

   Simple GTD States.  

#+begin_src emacs-lisp 
  (setq org-todo-keywords '((sequence "TODO(t)" "NEXT(n)" "STARTED(g)" "|" "DONE(d@/!)")
                            (sequence "PROJECT(p)" "|" "FINISHED(f)")
                            (sequence "SOMEDAY(s)" "MAYBE(m)") 
                            (sequence  "WAITING(w@/!)")
                            ))
#+end_src
 
** Enable fast selection of TODO states

Fast selection is good! But not on tags.

#+begin_src emacs-lisp 
(setq org-fast-tag-selection-include-todo nil)
#+end_src

** Log state changes into a drawer

#+begin_src emacs-lisp 
(setq org-log-into-drawer t)
#+end_src

