Org-Grimoire.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-18 Fri 10:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org-Grimoire</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jonathan Arkell" />
<link href="https://fonts.googleapis.com/css?family=Inconsolata|Nixie+One|Taviraj:300,400" rel="stylesheet"><link href="./assets/styles/tufte-style.css" rel="stylesheet"></head>
<body>
<div id="preamble" class="status">
<menu class="top"><a href="index.html"> Index </a><a href="Emagician.html"> Emagician </a><a href="Emagician-Base.html"> Base </a><a href="Emagician-Install.html"> Install </a><a href="Emagician-Meta.html"> Meta </a><a href="Interface.html"> Interface </a><a href="Programming.html"> Programming </a><a href="Text.html"> Text </a><a href="Org-Grimoire.html"> Org </a><a href="Lamp.html"> Lamp </a><a href="Journal.html"> Journal </a><a href="Snippets.html"> Snippets </a></menu><menu class="ext"><a class="dotnet" href="http://www.jonnay.net/">jonnay.net</a><a class="github" href="https://github.com/jonnay/emagicians-starter-kit">Fork on Github</a></menu>
</div>
<div id="content">
<h1 class="title">Org-Grimoire</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1a61ad6">1. Introduction</a></li>
<li><a href="#org90cb304">2. How to use this Guide</a></li>
<li><a href="#org17ab939">3. Org fixing - all the small things that need tweaking</a>
<ul>
<li><a href="#org79d84b6">3.1. Saveplace</a></li>
<li><a href="#org348fe43">3.2. Turn on flyspell</a></li>
<li><a href="#orgdefd90a">3.3. Fix YAS</a></li>
</ul>
</li>
<li><a href="#orgcc4d254">4. What do I need.</a></li>
<li><a href="#org8524f69">5. Agenda Files</a></li>
<li><a href="#orgdcf462b">6. <span class="todo TODO">TODO</span> s</a>
<ul>
<li><a href="#org313548e">6.1. Start with states.</a></li>
<li><a href="#org523510d">6.2. Enable fast selection of TODO states</a></li>
<li><a href="#org3a65ec8">6.3. Log state changes into a drawer</a></li>
<li><a href="#org9a5326d">6.4. Faces</a></li>
<li><a href="#org79eb52d">6.5. Set as next action</a></li>
<li><a href="#orgf7374e6">6.6. GO!</a></li>
</ul>
</li>
<li><a href="#org2791a11">7. Tags</a>
<ul>
<li><a href="#org50d75a9">7.1. Tags are a fluid thing</a></li>
<li><a href="#org741d794">7.2. Display</a></li>
<li><a href="#org5665fa6">7.3. Tags for contexts</a></li>
<li><a href="#orgdcd1e0a">7.4. State selection etc</a></li>
<li><a href="#org703ab8e">7.5. Preset tags</a></li>
</ul>
</li>
<li><a href="#org4f66f76">8. Categories</a>
<ul>
<li><a href="#orgb4792c0">8.1. Icons</a></li>
</ul>
</li>
<li><a href="#org616d43a">9. Stuck Projects</a></li>
<li><a href="#org55bec0e">10. Habits</a>
<ul>
<li><a href="#orgea982da">10.1. Example of my weekly Review habit</a></li>
</ul>
</li>
<li><a href="#orgd60c964">11. Refiling</a></li>
<li><a href="#org98dfa3f">12. Better Linking</a>
<ul>
<li><a href="#org464cd89">12.1. Set keybinding for links&#xa0;&#xa0;&#xa0;<span class="tag"><span class="keybinding">keybinding</span></span></a></li>
<li><a href="#org6a32edb">12.2. Store info pages as links</a></li>
</ul>
</li>
<li><a href="#orged967d2">13. Capturing and Capture Templates</a></li>
<li><a href="#org69b85e8">14. Pomodoro</a></li>
<li><a href="#orgc0d3856">15. Diary</a>
<ul>
<li><a href="#org7739e27">15.1. Set Location</a>
<ul>
<li><a href="#org99bae05">15.1.1. Like actual location too, so sunrise/sunset is handled well</a></li>
</ul>
</li>
<li><a href="#org829c6d3">15.2. Include it in agenda</a></li>
<li><a href="#orge4df970">15.3. Now for warnings</a></li>
</ul>
</li>
<li><a href="#org04f38a1">16. Attachments</a></li>
<li><a href="#org2fb42d1">17. Agenda</a>
<ul>
<li><a href="#org2e58294">17.1. Basic customizations</a>
<ul>
<li><a href="#org13ebb99">17.1.1. Dim Tasks</a></li>
</ul>
</li>
<li><a href="#org9dd52d3">17.2. Tweak the look</a></li>
<li><a href="#orgf3720e3">17.3. Display a cool title</a></li>
<li><a href="#orgc77583a">17.4. Display a cool subtitle with Kawaii</a></li>
<li><a href="#org2b93383">17.5. Display Goals at the top of agenda</a></li>
<li><a href="#org3211ac9">17.6. Display the current cycles</a>
<ul>
<li><a href="#org7789d5f">17.6.1. Lunar Phase</a></li>
<li><a href="#org7fe43ad">17.6.2. Solar Calendar</a></li>
<li><a href="#org08b504b">17.6.3. <span class="todo TODO">TODO</span> Erisian Calendar</a></li>
<li><a href="#orgec8b5d8">17.6.4. <span class="todo TODO">TODO</span> 8 Wheel Spoke</a></li>
<li><a href="#orgf0f3f26">17.6.5. Cycle Display</a></li>
</ul>
</li>
<li><a href="#org6ea22b2">17.7. Specific agenda frame</a></li>
<li><a href="#org89d152a">17.8. Display the current context</a>
<ul>
<li><a href="#orgd75a790">17.8.1. <span class="todo TODO">TODO</span> Get context from Location</a></li>
</ul>
</li>
<li><a href="#org642b2c9">17.9. Display based on tags</a></li>
<li><a href="#org7ad08eb">17.10. Find Stuck projects</a></li>
<li><a href="#org1083a46">17.11. Finalize agenda</a>
<ul>
<li><a href="#org4ee24c5">17.11.1. set up a custom agenda with our sections</a></li>
<li><a href="#org2543b2d">17.11.2. Display the started action</a></li>
<li><a href="#org9d264f3">17.11.3. Display next actions for the context</a></li>
<li><a href="#orgd2df5c1">17.11.4. <span class="todo PROJECT">PROJECT</span> List all next actions on a keystroke (F4)</a>
<ul>
<li><a href="#org120688a">17.11.4.1. <span class="todo NEXT">NEXT</span> Org agenda command</a></li>
<li><a href="#org3f78d87">17.11.4.2. <span class="todo TODO">TODO</span> filter to work</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf4875bb">17.12. Make it convenient</a>
<ul>
<li><a href="#org5589b95">17.12.1. Function to show the main agenda</a></li>
<li><a href="#org5a4e233">17.12.2. Main agenda key</a></li>
</ul>
</li>
<li><a href="#org1d87ceb">17.13. Display the daily agenda on load</a></li>
</ul>
</li>
<li><a href="#orgda4e47e">18. Exports</a>
<ul>
<li><a href="#orgab913f0">18.1. Htmlize</a></li>
</ul>
</li>
<li><a href="#org0870173">19. Plotting</a></li>
<li><a href="#org795268b">20. Working with Code in Babel mode</a>
<ul>
<li><a href="#org9a8788d">20.1. Languages</a></li>
</ul>
</li>
<li><a href="#org1f8dc24">21. Saving and auto Commiting</a>
<ul>
<li>
<ul>
<li><a href="#org550abd4">21.0.1. <span class="todo TODO">TODO</span> fix this to use shell commands instead.</a></li>
<li><a href="#org8d261bb">21.0.2. Mobile Org</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org038da8a">22. Prettiness</a></li>
<li><a href="#org6ce69c1">23. References and Shoutouts</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1a61ad6" class="outline-2">
<h2 id="org1a61ad6"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Trying to keep my org-mode setup inside of the Emagicians Starter
Kit was getting too insane.  On top of that I declared
org-bankruptcy awhile ago, and haven't really recovered since.  And
so, here is a fresh new attempt at using org.  Along with it will be
a tutorial that anyone can follow along with and get themselves into
a better state.
</p>
</div>
</div>

<div id="outline-container-org90cb304" class="outline-2">
<h2 id="org90cb304"><span class="section-number-2">2</span> How to use this Guide</h2>
<div class="outline-text-2" id="text-2">
<p>
Not sure yet. Wait till it is written.
</p>
</div>
</div>

<div id="outline-container-org17ab939" class="outline-2">
<h2 id="org17ab939"><span class="section-number-2">3</span> Org fixing - all the small things that need tweaking</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org79d84b6" class="outline-3">
<h3 id="org79d84b6"><span class="section-number-3">3.1</span> Saveplace</h3>
<div class="outline-text-3" id="text-3-1">
<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">emagician-org/fix-saveplace</span> ()
    <span class="org-doc">"Fixes a bit of brokenness with saveplace.el and org-mode"</span>
    (<span class="org-keyword">when</span> (outline-invisible-p)
      (<span class="org-keyword">save-excursion</span>
        (outline-previous-visible-heading 1)
        (org-show-subtree))))

  (add-hook 'org-mode-hook 'emagician-org/fix-saveplace)
</code></pre>
</div>
</div>

<div id="outline-container-org348fe43" class="outline-3">
<h3 id="org348fe43"><span class="section-number-3">3.2</span> Turn on flyspell</h3>
<div class="outline-text-3" id="text-3-2">
<pre class="code"><code>(add-hook 'org-mode-hook 'flyspell-mode)
</code></pre>
</div>
</div>

<div id="outline-container-orgdefd90a" class="outline-3">
<h3 id="orgdefd90a"><span class="section-number-3">3.3</span> Fix YAS</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The latest version of yasnippet doesn't play well with Org mode.
If the above code does not fix the conflict, start by defining the
following function:
</p>
<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">yas/org-very-safe-expand</span> ()
  (<span class="org-keyword">let</span> ((yas/fallback-behavior 'return-nil)) (yas/expand)))
</code></pre>

<p>
Then, tell Org mode what to do with the new function:
</p>
<pre class="code"><code>(<span class="org-keyword">emagician/defhook</span> fix-yasnippet-for-org org-mode-hook
  (make-variable-buffer-local 'yas/trigger-key)
  (<span class="org-keyword">setq</span> yas/trigger-key [tab])
  (add-to-list 'org-tab-first-hook 'yas/org-very-safe-expand)
  (define-key yas/keymap [tab] 'yas/next-field))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgcc4d254" class="outline-2">
<h2 id="orgcc4d254"><span class="section-number-2">4</span> What do I need.</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Basic Todo Listing and entry 
<ul class="org-ul">
<li>Grouping of tasks under a project
<ul class="org-ul">
<li>Tasks Have states: TODO, NEXT, WAITING and DONE.</li>
<li>Show all Next Actions</li>
</ul></li>
</ul></li>
<li>Pomodoro
<ul class="org-ul">
<li>Timers</li>
</ul></li>
<li>Journaling and time management
<ul class="org-ul">
<li>Prompt for when tasks change state</li>
<li>show time spent on a task.</li>
</ul></li>
<li>Habits For Review</li>
<li>Agendas</li>
<li>Quick access to org files</li>
<li>Sane attachment handling (link to, not copy)</li>
</ul>
</div>
</div>
<div id="outline-container-org8524f69" class="outline-2">
<h2 id="org8524f69"><span class="section-number-2">5</span> Agenda Files</h2>
<div class="outline-text-2" id="text-5">
<pre class="code"><code>(<span class="org-keyword">setq</span> org-agenda-files '(<span class="org-string">"~/org/"</span> <span class="org-string">"~/Dropbox/arduino/BunnyCyborg/BunnyCyborg.org"</span> <span class="org-string">"~/Dropbox/Creativity/Site3.0/Site.org"</span>))
</code></pre>
</div>
</div>

<div id="outline-container-orgdcf462b" class="outline-2">
<h2 id="orgdcf462b"><span class="section-number-2">6</span> <span class="todo TODO">TODO</span> s</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org313548e" class="outline-3">
<h3 id="org313548e"><span class="section-number-3">6.1</span> Start with states.</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Simple GTD States.  
</p>

<pre class="code"><code>(<span class="org-keyword">setq</span> org-todo-keywords '((sequence <span class="org-string">"TODO(t)"</span> <span class="org-string">"NEXT(n)"</span> <span class="org-string">"STARTED(g)"</span> <span class="org-string">"|"</span> <span class="org-string">"DONE(d@/!)"</span>)
                          (sequence <span class="org-string">"PROJECT(p)"</span> <span class="org-string">"|"</span> <span class="org-string">"FINISHED(f)"</span>)
                          (sequence <span class="org-string">"SOMEDAY(s)"</span> <span class="org-string">"MAYBE(m)"</span>) 
                          (sequence  <span class="org-string">"WAITING(w@/!)"</span>)
                          ))
</code></pre>
</div>
</div>

<div id="outline-container-org523510d" class="outline-3">
<h3 id="org523510d"><span class="section-number-3">6.2</span> Enable fast selection of TODO states</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Fast selection is good! But not on tags.
</p>

<pre class="code"><code>(<span class="org-keyword">setq</span> org-fast-tag-selection-include-todo nil)
</code></pre>
</div>
</div>

<div id="outline-container-org3a65ec8" class="outline-3">
<h3 id="org3a65ec8"><span class="section-number-3">6.3</span> Log state changes into a drawer</h3>
<div class="outline-text-3" id="text-6-3">
<pre class="code"><code>(<span class="org-keyword">setq</span> org-log-into-drawer t)
</code></pre>
</div>
</div>
