Org-Grimoire.org
** Faces
A better looking org mode looks better.

#+begin_src emacs-lisp 
  (setq org-todo-keyword-faces
        `(("TODO" :foreground "red" 
                  :background "red4" :weight bold :box (:line-width 2 :color "red3" :style released-button))
          ("PROJECT" :foreground "cyan" :background "cyan4" :weight bold :box (:line-width 2 :color "cyan3" :style released-button))
          ("HABIT" :foreground "DodgerBlue4" :background "DodgerBlue2" :weight bold :box (:line-width 2 :color "DodgerBlue2" :style released-button))
          ("NEXT" :foreground "DodgerBlue4" :background "DodgerBlue2" :weight bold :box (:line-width 2 :color "DodgerBlue2" :style released-button))
          ("STARTED" :foreground "blue" :background "blue4" :weight bold :box (:line-width 2 :color "blue3" :style released-button))
          ("DONE" :foreground "chartreuse" 
                  :background "chartreuse4" :weight bold :box (:line-width 2 :color "chartreuse3" :style released-button))
          ("FINISHED" :foreground "SeaGreen1" 
                  :background "SeaGreen4" :weight bold :box (:line-width 2 :color "SeaGreen3" :style released-button))
          ("WAITING" :foreground "orange" 
                     :background "orange4" :weight bold :box (:line-width 2 :color "orange3" :style released-button))
          ("SOMEDAY" :foreground "purple1"
                     :background "purple4" :weight bold :box (:line-width 2 :color "purple3" :style released-button))))


#+end_src
** Set as next action
#+BEGIN_SRC emacs-lisp
  (defun emagician-org/todo-to-next ()
    "sets the todo state of the current headline to next."
    (interactive)
    (org-todo "NEXT")
    (org-set-tags))
  
  (eval-after-load 'org
   '(define-key org-mode-map (kbd "C-c n") 'emagician-org/todo-to-next))
#+END_SRC

** GO!
#+begin_src emacs-lisp 
    (defun emagician-org/go ()
      "Launches the task at point, and starts a pomodoro if required"
      (interactive)
      (if (org-entry-is-todo-p)
          (progn
            (org-todo "STARTED")
            (if (not (org-pomodoro-active-p))
                (org-pomodoro-start)
              (progn
                (when (org-clocking-p)
                  (org-clock-out nil t))
                (org-pomodoro-kill))))
        (warn "Not on a TODO task")))

    (eval-after-load 'org '(define-key org-mode-map (kbd "C-c g") 'emagician-org/go))
#+end_src

* Tags
** Tags are a fluid thing
   So list em all!

#+begin_src emacs-lisp 
  (require 'dash)
  (defun emagician/get-tag-counts ()
    "Thanks to John Kitchin for this" 
    (let ((all-tags '()))
      (org-map-entries
       (lambda ()
         (let ((tag-string (car (last (org-heading-components)))))
           (when tag-string   
             (setq all-tags
                   (append all-tags (split-string tag-string ":" t))))))
       t
       'agenda)
      ;; now get counts
      (loop for tag in (-uniq all-tags) 
            collect (cons tag (cl-count tag all-tags :test 'string=)))))
#+end_src
   
** Display
#+begin_src emacs-lisp 
(setq org-tags-column -100)
(setq org-agenda-tags-column -100)
#+end_src

** Tags for contexts

#+begin_src emacs-lisp :tangle no :results value code
(emagician/get-tag-counts)
#+end_src

#+RESULTS:
#+BEGIN_SRC emacs-lisp :tangle no
(("read" . 4)
 ("braindead" . 29)
 ("brainstorm" . 8)
 ("web" . 14)
 ("emacs" . 7)
 ("research" . 9)
 ("ATTACH" . 1)
 ("gtd" . 2)
 ("meta" . 2)
 ("inbox" . 1)
 ("goal" . 7)
 ("goals" . 1)
 ("design" . 11)
 ("code" . 18)
 ("write" . 12)
 ("decide" . 3)
 ("home" . 4)
 ("vm" . 3)
 ("phone" . 1)
 ("shell" . 1)
 ("talk" . 2)
 ("mail" . 2)
 ("Watch" . 1)
 ("watch" . 2)
 ("sohan" . 1)
 ("ableton" . 4)
 ("breakbeat" . 1)
 ("max4live" . 1)
 ("culture" . 2)
 ("narrative" . 4)
 ("latex" . 1)
 ("eris" . 3)
 ("musical" . 3)
 ("theory" . 4)
 ("economics" . 1)
 ("society" . 3)
 ("thoery" . 2)
 ("bunny" . 3)
 ("news" . 3)
 ("markup" . 1)
 ("mixing" . 2)
 ("stereo" . 1)
 ("propaganda" . 1)
 ("site" . 1)
 ("sekrut" . 1)
 ("music" . 14)
 ("acid" . 10)
 ("breaks" . 1)
 ("techno" . 7)
 ("industrial" . 1)
 ("mashup" . 1)
 ("atmospheric" . 5)
 ("dnb" . 5)
 ("ambient" . 4)
 ("amen" . 2)
 ("levee" . 1)
 ("freesound" . 2)
 ("dub" . 1)
 ("zen" . 1)
 ("minimal" . 1)
 ("mix" . 5)
 ("liquid" . 2)
 ("video" . 23)
 ("introduction" . 1)
 ("perfection" . 2)
 ("creativity" . 5)
 ("phineas_and_ferb" . 1)
 ("memento_mori" . 1)
 ("303" . 2)
 ("fun" . 1)
 ("kawaii" . 1)
 ("compression" . 1)
 ("drawsplanation" . 3)
 ("synths" . 1)
 ("story" . 2)
 ("journal" . 1)
 ("journaling" . 1)
 ("coincidence" . 1)
 ("syncronicity" . 1)
 ("topx" . 1)
 ("games" . 1)
 ("plugins" . 1)
 ("podcasts" . 1)
 ("videos" . 1)
 ("family" . 2)
 ("archetypes" . 1)
 ("symbolism" . 1)
 ("learning" . 1)
 ("breakbeats" . 1)
 ("think" . 1)
 ("media" . 1)
 ("collaboration" . 2)
 ("explodingkittens" . 1)
 ("update9" . 1)
 ("epicambientbattle" . 3)
 ("copyright" . 1)
 ("flow" . 1)
 ("meagen" . 1)
 ("weird" . 1)
 ("drawspanation" . 1)
 ("iteration" . 1)
 ("toolmaking" . 1)
 ("relationships" . 1)
 ("jailfree" . 2)
 ("seed" . 1)
 ("art" . 37)
 ("deviantart" . 37))
#+END_SRC

** State selection etc
#+begin_src emacs-lisp 
(setq org-use-fast-tag-selection t)
#+end_src

