Org-Grimoire.html

<div id="outline-container-org9a5326d" class="outline-3">
<h3 id="org9a5326d"><span class="section-number-3">6.4</span> Faces</h3>
<div class="outline-text-3" id="text-6-4">
<p>
A better looking org mode looks better.
</p>

<pre class="code"><code>(<span class="org-keyword">setq</span> org-todo-keyword-faces
      `((<span class="org-string">"TODO"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"red"</span> 
                <span class="org-builtin">:background</span> <span class="org-string">"red4"</span> <span class="org-builtin">:weight</span> bold <span class="org-builtin">:box</span> (<span class="org-builtin">:line-width</span> 2 <span class="org-builtin">:color</span> <span class="org-string">"red3"</span> <span class="org-builtin">:style</span> released-button))
        (<span class="org-string">"PROJECT"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"cyan"</span> <span class="org-builtin">:background</span> <span class="org-string">"cyan4"</span> <span class="org-builtin">:weight</span> bold <span class="org-builtin">:box</span> (<span class="org-builtin">:line-width</span> 2 <span class="org-builtin">:color</span> <span class="org-string">"cyan3"</span> <span class="org-builtin">:style</span> released-button))
        (<span class="org-string">"HABIT"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"DodgerBlue4"</span> <span class="org-builtin">:background</span> <span class="org-string">"DodgerBlue2"</span> <span class="org-builtin">:weight</span> bold <span class="org-builtin">:box</span> (<span class="org-builtin">:line-width</span> 2 <span class="org-builtin">:color</span> <span class="org-string">"DodgerBlue2"</span> <span class="org-builtin">:style</span> released-button))
        (<span class="org-string">"NEXT"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"DodgerBlue4"</span> <span class="org-builtin">:background</span> <span class="org-string">"DodgerBlue2"</span> <span class="org-builtin">:weight</span> bold <span class="org-builtin">:box</span> (<span class="org-builtin">:line-width</span> 2 <span class="org-builtin">:color</span> <span class="org-string">"DodgerBlue2"</span> <span class="org-builtin">:style</span> released-button))
        (<span class="org-string">"STARTED"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"blue"</span> <span class="org-builtin">:background</span> <span class="org-string">"blue4"</span> <span class="org-builtin">:weight</span> bold <span class="org-builtin">:box</span> (<span class="org-builtin">:line-width</span> 2 <span class="org-builtin">:color</span> <span class="org-string">"blue3"</span> <span class="org-builtin">:style</span> released-button))
        (<span class="org-string">"DONE"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"chartreuse"</span> 
                <span class="org-builtin">:background</span> <span class="org-string">"chartreuse4"</span> <span class="org-builtin">:weight</span> bold <span class="org-builtin">:box</span> (<span class="org-builtin">:line-width</span> 2 <span class="org-builtin">:color</span> <span class="org-string">"chartreuse3"</span> <span class="org-builtin">:style</span> released-button))
        (<span class="org-string">"FINISHED"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"SeaGreen1"</span> 
                <span class="org-builtin">:background</span> <span class="org-string">"SeaGreen4"</span> <span class="org-builtin">:weight</span> bold <span class="org-builtin">:box</span> (<span class="org-builtin">:line-width</span> 2 <span class="org-builtin">:color</span> <span class="org-string">"SeaGreen3"</span> <span class="org-builtin">:style</span> released-button))
        (<span class="org-string">"WAITING"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"orange"</span> 
                   <span class="org-builtin">:background</span> <span class="org-string">"orange4"</span> <span class="org-builtin">:weight</span> bold <span class="org-builtin">:box</span> (<span class="org-builtin">:line-width</span> 2 <span class="org-builtin">:color</span> <span class="org-string">"orange3"</span> <span class="org-builtin">:style</span> released-button))
        (<span class="org-string">"SOMEDAY"</span> <span class="org-builtin">:foreground</span> <span class="org-string">"purple1"</span>
                   <span class="org-builtin">:background</span> <span class="org-string">"purple4"</span> <span class="org-builtin">:weight</span> bold <span class="org-builtin">:box</span> (<span class="org-builtin">:line-width</span> 2 <span class="org-builtin">:color</span> <span class="org-string">"purple3"</span> <span class="org-builtin">:style</span> released-button))))


</code></pre>
</div>
</div>
<div id="outline-container-org79eb52d" class="outline-3">
<h3 id="org79eb52d"><span class="section-number-3">6.5</span> Set as next action</h3>
<div class="outline-text-3" id="text-6-5">
<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">emagician-org/todo-to-next</span> ()
  <span class="org-doc">"sets the todo state of the current headline to next."</span>
  (<span class="org-keyword">interactive</span>)
  (org-todo <span class="org-string">"NEXT"</span>)
  (org-set-tags))

(eval-after-load 'org
 '(define-key org-mode-map (kbd <span class="org-string">"C-c n"</span>) 'emagician-org/todo-to-next))
</code></pre>
</div>
</div>

<div id="outline-container-orgf7374e6" class="outline-3">
<h3 id="orgf7374e6"><span class="section-number-3">6.6</span> GO!</h3>
<div class="outline-text-3" id="text-6-6">
<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">emagician-org/go</span> ()
  <span class="org-doc">"Launches the task at point, and starts a pomodoro if required"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">if</span> (org-entry-is-todo-p)
      (<span class="org-keyword">progn</span>
        (org-todo <span class="org-string">"STARTED"</span>)
        (<span class="org-keyword">if</span> (not (org-pomodoro-active-p))
            (org-pomodoro-start)
          (<span class="org-keyword">progn</span>
            (<span class="org-keyword">when</span> (org-clocking-p)
              (org-clock-out nil t))
            (org-pomodoro-kill))))
    (<span class="org-warning">warn</span> <span class="org-string">"Not on a TODO task"</span>)))

(eval-after-load 'org '(define-key org-mode-map (kbd <span class="org-string">"C-c g"</span>) 'emagician-org/go))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org2791a11" class="outline-2">
<h2 id="org2791a11"><span class="section-number-2">7</span> Tags</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org50d75a9" class="outline-3">
<h3 id="org50d75a9"><span class="section-number-3">7.1</span> Tags are a fluid thing</h3>
<div class="outline-text-3" id="text-7-1">
<p>
So list em all!
</p>

<pre class="code"><code>(<span class="org-keyword">require</span> '<span class="org-constant">dash</span>)
(<span class="org-keyword">defun</span> <span class="org-function-name">emagician/get-tag-counts</span> ()
  <span class="org-doc">"Thanks to John Kitchin for this"</span> 
  (<span class="org-keyword">let</span> ((all-tags '()))
    (org-map-entries
     (<span class="org-keyword">lambda</span> ()
       (<span class="org-keyword">let</span> ((tag-string (car (last (org-heading-components)))))
         (<span class="org-keyword">when</span> tag-string   
           (<span class="org-keyword">setq</span> all-tags
                 (append all-tags (split-string tag-string <span class="org-string">":"</span> t))))))
     t
     'agenda)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">now get counts</span>
    (<span class="org-keyword">loop</span> for tag in (<span class="org-keyword">-uniq</span> all-tags) 
          collect (cons tag (cl-count tag all-tags <span class="org-builtin">:test</span> 'string=)))))
</code></pre>
</div>
</div>

<div id="outline-container-org741d794" class="outline-3">
<h3 id="org741d794"><span class="section-number-3">7.2</span> Display</h3>
<div class="outline-text-3" id="text-7-2">
<pre class="code"><code>(<span class="org-keyword">setq</span> org-tags-column -100)
(<span class="org-keyword">setq</span> org-agenda-tags-column -100)
</code></pre>
</div>
</div>

<div id="outline-container-org5665fa6" class="outline-3">
<h3 id="org5665fa6"><span class="section-number-3">7.3</span> Tags for contexts</h3>
<div class="outline-text-3" id="text-7-3">
<pre class="code"><code>(emagician/get-tag-counts)
</code></pre>
</div>
</div>

<div id="outline-container-orgdcd1e0a" class="outline-3">
<h3 id="orgdcd1e0a"><span class="section-number-3">7.4</span> State selection etc</h3>
<div class="outline-text-3" id="text-7-4">
<pre class="code"><code>(<span class="org-keyword">setq</span> org-use-fast-tag-selection t)
</code></pre>
</div>
</div>
