Org-Grimoire.org
** Preset tags

#+begin_src emacs-lisp 
  (setq org-tag-alist '((:startgroup   . nil) 
                        ("code"        . ?c)
                        ("design"      . ?d)
                        ("emacs"       . ?e)
                        ("gtd"         . ?g)                          
                        (:endgroup     . nil)
                        
                        (:startgroup  .   nil)                         
                        ("decide"     .   ?a)
                        ("phone"      .   ?p)
                        ("read"       .   ?r)
                        ("research"   .   ?u)
                        ("talk"       .   ?t)
                        ("vm"         .   ?v)
                        ("web"        .   ?w)
                        ("write"      .   ?x)
                        (:endgroup    .   nil)
                        
                        ("backburner" .   ?b)
                        ("braindead"  .   ?z)

                        (:newline     .   nil)                    
                        ("chaman"     .   ?C)
                        ("charles"    .   ?H)
                        ("paul"       .   ?P)
                        ("sohan"      .   ?S) 
                        ))
#+end_src       

* Categories 

Work, Music, Personal.  That's it.  Everything else should be a tag.  

** Icons
#+begin_src emacs-lisp 

(setq org-agenda-category-icon-alist 
      `(("Work"  ,(list (propertize "💼")))
        ("Music" ,(list (propertize "🎶" )))
        ("Home"  ,(list (propertize"🏡" )))))
#+end_src

* Stuck Projects
#+begin_src emacs-lisp 
(setq org-stuck-projects '("TODO=\"PROJECT\""
  ("NEXT")
  nil ""))
#+end_src

* Habits
#+begin_src emacs-lisp 
(require 'org-habit)
#+end_src


#+begin_src emacs-lisp 
(setq org-habit-graph-column 50)
#+end_src


#+begin_src emacs-lisp 
(add-to-list 'org-todo-keywords '(sequence "HABIT(h)" "|" "DONE(d!)") t)
#+end_src

** Example of my weekly Review habit
#+begin_src org 
`  ** HABIT Weekly
`     SCHEDULED: <2015-02-09 Mon 09:00 ++1w>
`     :PROPERTIES:
`     :STYLE:    habit
`     :LAST_REPEAT: [2015-02-02 Mon 16:39]
`     :END:
`     - [X] Get Clear
`       - [X] Clean off desk
`       - [X] Clean Out Bag
`       - [X] Clean off Desktop [[file:~/Desktop/]]   (~20 files per iteration)
`       - [X] Clean Downloads file:~/Downloads/   (~20 files per iteration)
`       - [X] Review Last weeks email
`       - [X] Liquid Planner Timesheet good to go
`       - [X] Clean out [[file:GTD.org::*Inbo˘x][Inbox]]
`       - [X] Archive all finished Tasks
`     - [-] Get Current
`  	 - [X] Review next months calendar
`  	 - [X] Check My upcoming work in LP
`  	 - [ ] Fix Any Stuck Projects
`  	 - [ ] Review Project Agenda
`  	 - [ ] Review Next Action Agenda
`  	 - [ ] Review Waiting Agenda
`     - [ ] Get Creative
`  	 - [ ] Review someday/maybe
`  	 - [ ] Do something creative and courageous
`  
#+end_src 
* Refiling
All agenda files are valid for targeting
#+begin_src emacs-lisp 
(setq org-refile-targets '((org-agenda-files :maxlevel . 1)))
(setq org-refile-use-outline-path 'file)
(setq org-outline-path-complete-in-steps nil)
#+end_src

* Better Linking
** Set keybinding for links										 :keybinding:
#+begin_src emacs-lisp 
(setq org-return-follows-link t)
#+end_src


#+begin_src emacs-lisp
(define-key global-map "\C-cl" 'org-store-link)

(setq org-return-follows-link t)
#+end_src

** Store info pages as links
#+begin_src emacs-lisp
(require 'org-info)
#+end_src
* Capturing and Capture Templates
#+begin_src emacs-lisp 
(define-key global-map (kbd "C-c c") 'org-capture)
(define-key global-map (kbd "C-c i") 'emagician-org-capture-inbox)
#+end_src

#+begin_src emacs-lisp 
(defun emagician-org-capture-inbox ()
  (interactive)
  (org-capture nil "i"))

(setq org-capture-templates
  '(("i" "Inbox" entry (file+headline "~/org/GTD.org" "Inbox")
         "** TODO %?\n  %i\n")))
#+end_src

* Pomodoro
  
  org-pomodoro is pretty simple, so lets start with that.

  ~C-c p~ Will start a pomodoro on your current task.  Call it during a pomodoro to reset.  

  #+begin_src emacs-lisp 
(use-package org-pomodoro
  :bind
  ("C-c p" . org-pomodoro))
  #+end_src

  Fancy it up a little

#+begin_src emacs-lisp 
(setq org-pomodoro-format "🍅~%s")
#+end_src

* Diary
** Set Location
#+begin_src emacs-lisp 
(setq diary-file "~/.emacs.d/diary")
#+end_src

*** Like actual location too, so sunrise/sunset is handled well
51.0368334,-114.0715046,15z
#+begin_src emacs-lisp 
(setq calendar-longitude -114.0715046)
(setq calendar-latitude 51.0368334)
#+end_src


** Include it in agenda
#+begin_src emacs-lisp 
(setq org-agenda-include-diary t)
#+end_src

** Now for warnings
#+begin_src emacs-lisp 
(appt-activate 1)
(org-agenda-to-appt)
#+end_src

* Attachments
#+begin_src emacs-lisp 
  (setq org-attach-allow-inheritance t)
  (setq org-attach-store-link-p t)
#+end_src

* Agenda
