Org-Grimoire.html

<div id="outline-container-org703ab8e" class="outline-3">
<h3 id="org703ab8e"><span class="section-number-3">7.5</span> Preset tags</h3>
<div class="outline-text-3" id="text-7-5">
<pre class="code"><code>(<span class="org-keyword">setq</span> org-tag-alist '((<span class="org-builtin">:startgroup</span>   . nil) 
                      (<span class="org-string">"code"</span>        . ?c)
                      (<span class="org-string">"design"</span>      . ?d)
                      (<span class="org-string">"emacs"</span>       . ?e)
                      (<span class="org-string">"gtd"</span>         . ?g)                          
                      (<span class="org-builtin">:endgroup</span>     . nil)

                      (<span class="org-builtin">:startgroup</span>  .   nil)                         
                      (<span class="org-string">"decide"</span>     .   ?a)
                      (<span class="org-string">"phone"</span>      .   ?p)
                      (<span class="org-string">"read"</span>       .   ?r)
                      (<span class="org-string">"research"</span>   .   ?u)
                      (<span class="org-string">"talk"</span>       .   ?t)
                      (<span class="org-string">"vm"</span>         .   ?v)
                      (<span class="org-string">"web"</span>        .   ?w)
                      (<span class="org-string">"write"</span>      .   ?x)
                      (<span class="org-builtin">:endgroup</span>    .   nil)

                      (<span class="org-string">"backburner"</span> .   ?b)
                      (<span class="org-string">"braindead"</span>  .   ?z)

                      (<span class="org-builtin">:newline</span>     .   nil)                    
                      (<span class="org-string">"chaman"</span>     .   ?C)
                      (<span class="org-string">"charles"</span>    .   ?H)
                      (<span class="org-string">"paul"</span>       .   ?P)
                      (<span class="org-string">"sohan"</span>      .   ?S) 
                      ))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org4f66f76" class="outline-2">
<h2 id="org4f66f76"><span class="section-number-2">8</span> Categories</h2>
<div class="outline-text-2" id="text-8">
<p>
Work, Music, Personal.  That's it.  Everything else should be a tag.  
</p>
</div>

<div id="outline-container-orgb4792c0" class="outline-3">
<h3 id="orgb4792c0"><span class="section-number-3">8.1</span> Icons</h3>
<div class="outline-text-3" id="text-8-1">
<pre class="code"><code>
(<span class="org-keyword">setq</span> org-agenda-category-icon-alist 
      `((<span class="org-string">"Work"</span>  ,(list (propertize <span class="org-string">"&#128188;"</span>)))
        (<span class="org-string">"Music"</span> ,(list (propertize <span class="org-string">"&#127926;"</span> )))
        (<span class="org-string">"Home"</span>  ,(list (propertize<span class="org-string">"&#127969;"</span> )))))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org616d43a" class="outline-2">
<h2 id="org616d43a"><span class="section-number-2">9</span> Stuck Projects</h2>
<div class="outline-text-2" id="text-9">
<pre class="code"><code>(<span class="org-keyword">setq</span> org-stuck-projects '(<span class="org-string">"TODO=\"PROJECT\""</span>
  (<span class="org-string">"NEXT"</span>)
  nil <span class="org-string">""</span>))
</code></pre>
</div>
</div>

<div id="outline-container-org55bec0e" class="outline-2">
<h2 id="org55bec0e"><span class="section-number-2">10</span> Habits</h2>
<div class="outline-text-2" id="text-10">
<pre class="code"><code>(<span class="org-keyword">require</span> '<span class="org-constant">org-habit</span>)
</code></pre>


<pre class="code"><code>(<span class="org-keyword">setq</span> org-habit-graph-column 50)
</code></pre>


<pre class="code"><code>(add-to-list 'org-todo-keywords '(sequence <span class="org-string">"HABIT(h)"</span> <span class="org-string">"|"</span> <span class="org-string">"DONE(d!)"</span>) t)
</code></pre>
</div>

<div id="outline-container-orgea982da" class="outline-3">
<h3 id="orgea982da"><span class="section-number-3">10.1</span> Example of my weekly Review habit</h3>
<div class="outline-text-3" id="text-10-1">
<pre class="code"><code>`  ** HABIT Weekly
`     <span class="org-org-special-keyword">SCHEDULED:</span> <span class="org-org-date">&lt;2015-02-09 Mon 09:00 ++1w&gt;</span>
`     :PROPERTIES:
`     :STYLE:    habit
`     :LAST_REPEAT: <span class="org-org-date">[2015-02-02 Mon 16:39]</span>
`     :END:
`     - [X] Get Clear
`       - [X] Clean off desk
`       - [X] Clean Out Bag
`       - [X] Clean off Desktop <span class="org-org-link"><a href="file:~/Desktop/">file:~/Desktop/</a></span>   (~20 files per iteration)
`       - [X] Clean Downloads <span class="org-org-link"><a href="file:~/Downloads/">file:~/Downloads/</a></span>   (~20 files per iteration)
`       - [X] Review Last weeks email
`       - [X] Liquid Planner Timesheet good to go
`       - [X] Clean out <span class="org-org-link"><a href="file:GTD.org::*Inbo&#728;x">Inbox</a></span>
`       - [X] Archive all finished Tasks
`     - [-] Get Current
`        - [X] Review next months calendar
`        - [X] Check My upcoming work in LP
`        - [ ] Fix Any Stuck Projects
`        - [ ] Review Project Agenda
`        - [ ] Review Next Action Agenda
`        - [ ] Review Waiting Agenda
`     - [ ] Get Creative
`        - [ ] Review someday/maybe
`        - [ ] Do something creative and courageous
`  
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgd60c964" class="outline-2">
<h2 id="orgd60c964"><span class="section-number-2">11</span> Refiling</h2>
<div class="outline-text-2" id="text-11">
<p>
All agenda files are valid for targeting
</p>
<pre class="code"><code>(<span class="org-keyword">setq</span> org-refile-targets '((org-agenda-files <span class="org-builtin">:maxlevel</span> . 1)))
(<span class="org-keyword">setq</span> org-refile-use-outline-path 'file)
(<span class="org-keyword">setq</span> org-outline-path-complete-in-steps nil)
</code></pre>
</div>
</div>

<div id="outline-container-org98dfa3f" class="outline-2">
<h2 id="org98dfa3f"><span class="section-number-2">12</span> Better Linking</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org464cd89" class="outline-3">
<h3 id="org464cd89"><span class="section-number-3">12.1</span> Set keybinding for links&#xa0;&#xa0;&#xa0;<span class="tag"><span class="keybinding">keybinding</span></span></h3>
<div class="outline-text-3" id="text-12-1">
<pre class="code"><code>(<span class="org-keyword">setq</span> org-return-follows-link t)
</code></pre>


<pre class="code"><code>(define-key global-map <span class="org-string">"\C-cl"</span> 'org-store-link)

(<span class="org-keyword">setq</span> org-return-follows-link t)
</code></pre>
</div>
</div>

<div id="outline-container-org6a32edb" class="outline-3">
<h3 id="org6a32edb"><span class="section-number-3">12.2</span> Store info pages as links</h3>
<div class="outline-text-3" id="text-12-2">
<pre class="code"><code>(<span class="org-keyword">require</span> '<span class="org-constant">org-info</span>)
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orged967d2" class="outline-2">
<h2 id="orged967d2"><span class="section-number-2">13</span> Capturing and Capture Templates</h2>
<div class="outline-text-2" id="text-13">
<pre class="code"><code>(define-key global-map (kbd <span class="org-string">"C-c c"</span>) 'org-capture)
(define-key global-map (kbd <span class="org-string">"C-c i"</span>) 'emagician-org-capture-inbox)
</code></pre>

<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">emagician-org-capture-inbox</span> ()
  (<span class="org-keyword">interactive</span>)
  (org-capture nil <span class="org-string">"i"</span>))

(<span class="org-keyword">setq</span> org-capture-templates
  '((<span class="org-string">"i"</span> <span class="org-string">"Inbox"</span> entry (file+headline <span class="org-string">"~/org/GTD.org"</span> <span class="org-string">"Inbox"</span>)
         <span class="org-string">"** TODO %?\n  %i\n"</span>)))
</code></pre>
</div>
</div>

<div id="outline-container-org69b85e8" class="outline-2">
<h2 id="org69b85e8"><span class="section-number-2">14</span> Pomodoro</h2>
<div class="outline-text-2" id="text-14">
<p>
org-pomodoro is pretty simple, so lets start with that.
</p>

<p>
<code>C-c p</code> Will start a pomodoro on your current task.  Call it during a pomodoro to reset.  
</p>

<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">org-pomodoro</span>
  <span class="org-builtin">:bind</span>
  (<span class="org-string">"C-c p"</span> . org-pomodoro))
</code></pre>

<p>
Fancy it up a little
</p>

<pre class="code"><code>(<span class="org-keyword">setq</span> org-pomodoro-format <span class="org-string">"&#127813;~%s"</span>)
</code></pre>
</div>
</div>

<div id="outline-container-orgc0d3856" class="outline-2">
<h2 id="orgc0d3856"><span class="section-number-2">15</span> Diary</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org7739e27" class="outline-3">
<h3 id="org7739e27"><span class="section-number-3">15.1</span> Set Location</h3>
<div class="outline-text-3" id="text-15-1">
<pre class="code"><code>(<span class="org-keyword">setq</span> diary-file <span class="org-string">"~/.emacs.d/diary"</span>)
</code></pre>
</div>

<div id="outline-container-org99bae05" class="outline-4">
<h4 id="org99bae05"><span class="section-number-4">15.1.1</span> Like actual location too, so sunrise/sunset is handled well</h4>
<div class="outline-text-4" id="text-15-1-1">
<p>
51.0368334,-114.0715046,15z
</p>
<pre class="code"><code>(<span class="org-keyword">setq</span> calendar-longitude -114.0715046)
(<span class="org-keyword">setq</span> calendar-latitude 51.0368334)
</code></pre>
</div>
</div>
</div>


<div id="outline-container-org829c6d3" class="outline-3">
<h3 id="org829c6d3"><span class="section-number-3">15.2</span> Include it in agenda</h3>
<div class="outline-text-3" id="text-15-2">
<pre class="code"><code>(<span class="org-keyword">setq</span> org-agenda-include-diary t)
</code></pre>
</div>
</div>

<div id="outline-container-orge4df970" class="outline-3">
<h3 id="orge4df970"><span class="section-number-3">15.3</span> Now for warnings</h3>
<div class="outline-text-3" id="text-15-3">
<pre class="code"><code>(appt-activate 1)
(org-agenda-to-appt)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org04f38a1" class="outline-2">
<h2 id="org04f38a1"><span class="section-number-2">16</span> Attachments</h2>
<div class="outline-text-2" id="text-16">
<pre class="code"><code>(<span class="org-keyword">setq</span> org-attach-allow-inheritance t)
(<span class="org-keyword">setq</span> org-attach-store-link-p t)
</code></pre>
</div>
</div>
