Org-Grimoire.org
** Basic customizations
*** Dim Tasks 
#+begin_src emacs-lisp 
(setq org-agenda-dim-blocked-tasks t)
#+end_src

** Tweak the look
#+begin_src emacs-lisp 
(setq org-agenda-block-separator ?\═)
#+end_src

** Display a cool title
#+begin_src emacs-lisp 
    (defun emagician-agenda/insert-title (title)
      "show a centered title"
      (setq buffer-read-only nil)
      (let ((centering-str  (make-string (/ (- (window-body-width)
                                               (length title))
                                            2)
                                         ?\ )))
        (insert (propertize (concat centering-str title centering-str "\n")
                            'face
                           'org-agenda-structure))))

  (defun emagician-agenda/insert-separator ()
    (insert (make-string (window-body-width) org-agenda-block-separator) "\n"))

    (defun emagician-agenda/insert-headline (&rest args)
      "Daily wisdom, Cool title, etc."
      (setq buffer-read-only nil)
      (emagician-agenda/insert-separator)
      (emagician-agenda/insert-title "-|-+-|-")
      (emagician-agenda/insert-separator)
      (insert (concat (emagician/cookie-from-file "assets/collected-works-ov-chaos.lines") "\n")))

#+end_src
** Display a cool subtitle with Kawaii

**  Display Goals at the top of agenda
#+begin_src emacs-lisp 
  (defun emagician-agenda/get-goals (&rest args)
    "Show top level goal headlines"
    '(tags "goal" ((org-agenda-overriding-header "Goals")) "~/org/Goals.org"))
#+end_src  
** Display the current cycles
*** Lunar Phase
#+begin_src emacs-lisp 

(require 'lunar)

(setq lunar-phase-names 
     '("🌚 New Moon 🌚" "🌛 First Quarter🌛" "🌝 Full Moon 🌝" "🌜Last Quarter 🌜"))

(defun emagician-agenda/get-current-lunar-phase ()
  "Get the current lunar phase.  For some reason it is out of sync by a day, so... yea"
  (lunar-phase-name (mod (+ 1 (lunar-index (calendar-current-date)))
					   4)))

#+end_src
*** Solar Calendar
#+begin_src emacs-lisp 
(require 'solar)

;; Half works.  Kinda. 
(defun diary-equinoxes-solstices (date)
  "Equinox and solstice diary entry."
  (let* ((displayed-month (car date))
	 (displayed-year (car (cdr (cdr date))))
	 (equinox (solar-equinoxes-solstices)))
    (if (calendar-date-equal (car (car equinox)) date)
	(car (cdr (car equinox))))))
#+end_src

*** TODO Erisian Calendar
*** TODO 8 Wheel Spoke
*** Cycle Display 
#+begin_src emacs-lisp 

(defun emagician-agenda/insert-cycle (&rest args)
  (let ((buffer-read-only nil))
    (insert (emagician-agenda/get-current-lunar-phase))
	(insert "\n")
    (emagician-agenda/insert-separator)))
#+end_src

** Specific agenda frame
#+begin_src emacs-lisp 
(setq org-agenda-window-setup 'other-frame)
#+end_src

**  Display the current context
#+begin_src emacs-lisp 
(defvar emagician/org-context "Work")
#+end_src


*** TODO Get context from Location

** Display based on tags
Best is the enemy of the good.  Make this not suck later. 
#+begin_src emacs-lisp 
  (defun emagician-agenda/get-tag (tag title &optional include-dates) 
    (if (not include-dates)
      `(todo ,tag 
                ((org-agenda-overriding-header ,(concat title "\n"))
                 (org-agenda-todo-ignore-with-date t)))
       `(todo ,tag 
                ((org-agenda-overriding-header ,(concat title "\n"))))))
#+end_src

(emagician-agenda/get-tag "NEXT" "❇ Next Actions" t)


(todo "NEXT" ((org-agenda-overriding-header "❇ Next Actions") 
              (org-agenda-todo-ignore-with-date t)))

** Find Stuck projects
  
#+begin_src emacs-lisp 
(defun emagician-agenda/get-stuck-projects ()
  "return a string showing all Stuck projects"
  '(tags "TODO=\"PROJECT\""
              ((org-agenda-overriding-header " 📖 Stuck Projects")
               (org-agenda-skip-function '(org-agenda-skip-subtree-if 'regexp "NEXT")))))
#+end_src

** Finalize agenda
