Org-Grimoire.html

<div id="outline-container-org2fb42d1" class="outline-2">
<h2 id="org2fb42d1"><span class="section-number-2">17</span> Agenda</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-org2e58294" class="outline-3">
<h3 id="org2e58294"><span class="section-number-3">17.1</span> Basic customizations</h3>
<div class="outline-text-3" id="text-17-1">
</div>
<div id="outline-container-org13ebb99" class="outline-4">
<h4 id="org13ebb99"><span class="section-number-4">17.1.1</span> Dim Tasks</h4>
<div class="outline-text-4" id="text-17-1-1">
<pre class="code"><code>(<span class="org-keyword">setq</span> org-agenda-dim-blocked-tasks t)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org9dd52d3" class="outline-3">
<h3 id="org9dd52d3"><span class="section-number-3">17.2</span> Tweak the look</h3>
<div class="outline-text-3" id="text-17-2">
<pre class="code"><code>(<span class="org-keyword">setq</span> org-agenda-block-separator ?\&#9552;)
</code></pre>
</div>
</div>

<div id="outline-container-orgf3720e3" class="outline-3">
<h3 id="orgf3720e3"><span class="section-number-3">17.3</span> Display a cool title</h3>
<div class="outline-text-3" id="text-17-3">
<pre class="code"><code>  (<span class="org-keyword">defun</span> <span class="org-function-name">emagician-agenda/insert-title</span> (title)
    <span class="org-doc">"show a centered title"</span>
    (<span class="org-keyword">setq</span> buffer-read-only nil)
    (<span class="org-keyword">let</span> ((centering-str  (make-string (/ (- (window-body-width)
                                             (length title))
                                          2)
                                       ?\ )))
      (insert (propertize (concat centering-str title centering-str <span class="org-string">"\n"</span>)
                          'face
                         'org-agenda-structure))))

(<span class="org-keyword">defun</span> <span class="org-function-name">emagician-agenda/insert-separator</span> ()
  (insert (make-string (window-body-width) org-agenda-block-separator) <span class="org-string">"\n"</span>))

  (<span class="org-keyword">defun</span> <span class="org-function-name">emagician-agenda/insert-headline</span> (<span class="org-type">&amp;rest</span> args)
    <span class="org-doc">"Daily wisdom, Cool title, etc."</span>
    (<span class="org-keyword">setq</span> buffer-read-only nil)
    (emagician-agenda/insert-separator)
    (emagician-agenda/insert-title <span class="org-string">"-|-+-|-"</span>)
    (emagician-agenda/insert-separator)
    (insert (concat (emagician/cookie-from-file <span class="org-string">"assets/collected-works-ov-chaos.lines"</span>) <span class="org-string">"\n"</span>)))

</code></pre>
</div>
</div>
<div id="outline-container-orgc77583a" class="outline-3">
<h3 id="orgc77583a"><span class="section-number-3">17.4</span> Display a cool subtitle with Kawaii</h3>
</div>

<div id="outline-container-org2b93383" class="outline-3">
<h3 id="org2b93383"><span class="section-number-3">17.5</span> Display Goals at the top of agenda</h3>
<div class="outline-text-3" id="text-17-5">
<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">emagician-agenda/get-goals</span> (<span class="org-type">&amp;rest</span> args)
  <span class="org-doc">"Show top level goal headlines"</span>
  '(tags <span class="org-string">"goal"</span> ((org-agenda-overriding-header <span class="org-string">"Goals"</span>)) <span class="org-string">"~/org/Goals.org"</span>))
</code></pre>
</div>
</div>
<div id="outline-container-org3211ac9" class="outline-3">
<h3 id="org3211ac9"><span class="section-number-3">17.6</span> Display the current cycles</h3>
<div class="outline-text-3" id="text-17-6">
</div>
<div id="outline-container-org7789d5f" class="outline-4">
<h4 id="org7789d5f"><span class="section-number-4">17.6.1</span> Lunar Phase</h4>
<div class="outline-text-4" id="text-17-6-1">
<pre class="code"><code>
(<span class="org-keyword">require</span> '<span class="org-constant">lunar</span>)

(<span class="org-keyword">setq</span> lunar-phase-names 
     '(<span class="org-string">"&#127770; New Moon &#127770;"</span> <span class="org-string">"&#127771; First Quarter&#127771;"</span> <span class="org-string">"&#127773; Full Moon &#127773;"</span> <span class="org-string">"&#127772;Last Quarter &#127772;"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">emagician-agenda/get-current-lunar-phase</span> ()
  <span class="org-doc">"Get the current lunar phase.  For some reason it is out of sync by a day, so... yea"</span>
  (lunar-phase-name (mod (+ 1 (lunar-index (calendar-current-date)))
                                           4)))

</code></pre>
</div>
</div>
<div id="outline-container-org7fe43ad" class="outline-4">
<h4 id="org7fe43ad"><span class="section-number-4">17.6.2</span> Solar Calendar</h4>
<div class="outline-text-4" id="text-17-6-2">
<pre class="code"><code>(<span class="org-keyword">require</span> '<span class="org-constant">solar</span>)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Half works.  Kinda. </span>
(<span class="org-keyword">defun</span> <span class="org-function-name">diary-equinoxes-solstices</span> (date)
  <span class="org-doc">"Equinox and solstice diary entry."</span>
  (<span class="org-keyword">let*</span> ((displayed-month (car date))
         (displayed-year (car (cdr (cdr date))))
         (equinox (solar-equinoxes-solstices)))
    (<span class="org-keyword">if</span> (calendar-date-equal (car (car equinox)) date)
        (car (cdr (car equinox))))))
</code></pre>
</div>
</div>

<div id="outline-container-org08b504b" class="outline-4">
<h4 id="org08b504b"><span class="section-number-4">17.6.3</span> <span class="todo TODO">TODO</span> Erisian Calendar</h4>
</div>
<div id="outline-container-orgec8b5d8" class="outline-4">
<h4 id="orgec8b5d8"><span class="section-number-4">17.6.4</span> <span class="todo TODO">TODO</span> 8 Wheel Spoke</h4>
</div>
<div id="outline-container-orgf0f3f26" class="outline-4">
<h4 id="orgf0f3f26"><span class="section-number-4">17.6.5</span> Cycle Display</h4>
<div class="outline-text-4" id="text-17-6-5">
<pre class="code"><code>
(<span class="org-keyword">defun</span> <span class="org-function-name">emagician-agenda/insert-cycle</span> (<span class="org-type">&amp;rest</span> args)
  (<span class="org-keyword">let</span> ((buffer-read-only nil))
    (insert (emagician-agenda/get-current-lunar-phase))
        (insert <span class="org-string">"\n"</span>)
    (emagician-agenda/insert-separator)))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org6ea22b2" class="outline-3">
<h3 id="org6ea22b2"><span class="section-number-3">17.7</span> Specific agenda frame</h3>
<div class="outline-text-3" id="text-17-7">
<pre class="code"><code>(<span class="org-keyword">setq</span> org-agenda-window-setup 'other-frame)
</code></pre>
</div>
</div>

<div id="outline-container-org89d152a" class="outline-3">
<h3 id="org89d152a"><span class="section-number-3">17.8</span> Display the current context</h3>
<div class="outline-text-3" id="text-17-8">
<pre class="code"><code>(<span class="org-keyword">defvar</span> <span class="org-variable-name">emagician/org-context</span> <span class="org-string">"Work"</span>)
</code></pre>
</div>


<div id="outline-container-orgd75a790" class="outline-4">
<h4 id="orgd75a790"><span class="section-number-4">17.8.1</span> <span class="todo TODO">TODO</span> Get context from Location</h4>
</div>
</div>

<div id="outline-container-org642b2c9" class="outline-3">
<h3 id="org642b2c9"><span class="section-number-3">17.9</span> Display based on tags</h3>
<div class="outline-text-3" id="text-17-9">
<p>
Best is the enemy of the good.  Make this not suck later. 
</p>
<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">emagician-agenda/get-tag</span> (tag title <span class="org-type">&amp;optional</span> include-dates) 
  (<span class="org-keyword">if</span> (not include-dates)
    `(todo ,tag 
              ((org-agenda-overriding-header ,(concat title <span class="org-string">"\n"</span>))
               (org-agenda-todo-ignore-with-date t)))
     `(todo ,tag 
              ((org-agenda-overriding-header ,(concat title <span class="org-string">"\n"</span>))))))
</code></pre>

<p>
(emagician-agenda/get-tag "NEXT" " Next Actions" t)
</p>


<p>
(todo "NEXT" ((org-agenda-overriding-header " Next Actions") 
              (org-agenda-todo-ignore-with-date t)))
</p>
</div>
</div>

<div id="outline-container-org7ad08eb" class="outline-3">
<h3 id="org7ad08eb"><span class="section-number-3">17.10</span> Find Stuck projects</h3>
<div class="outline-text-3" id="text-17-10">
<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">emagician-agenda/get-stuck-projects</span> ()
  <span class="org-doc">"return a string showing all Stuck projects"</span>
  '(tags <span class="org-string">"TODO=\"PROJECT\""</span>
              ((org-agenda-overriding-header <span class="org-string">" &#128214; Stuck Projects"</span>)
               (org-agenda-skip-function '(org-agenda-skip-subtree-if 'regexp <span class="org-string">"NEXT"</span>)))))
</code></pre>
</div>
</div>

<div id="outline-container-org1083a46" class="outline-3">
<h3 id="org1083a46"><span class="section-number-3">17.11</span> Finalize agenda</h3>
<div class="outline-text-3" id="text-17-11">
</div>
