Org-Grimoire.org
*** set up a custom agenda with our sections

#+begin_src emacs-lisp 

        (setq org-agenda-custom-commands
              `((" " "Agenda"
                 ((emagician-agenda/insert-headline "")
                  ,(emagician-agenda/get-goals "")
                  (emagician-agenda/insert-cycle "") 
                  (agenda "" ((org-agenda-span 1) (org-agenda-show-log nil) ))
                  ,(emagician-agenda/get-tag "STARTED" "💥 Started" t)
                  ,(emagician-agenda/get-tag "WAITING" "💬 Waiting" t)
                  ,(emagician-agenda/get-tag "NEXT" "❇ Next Actions" t)
                  ,(emagician-agenda/get-stuck-projects))
                 ((org-agenda-category-filter-preset '("-Home" "-Music"))))
                ("W" "Weekly Review"
                 ((emagician-agenda/insert-headline " Weekly Review ")
                  (agenda "" ((org-agenda-span 7)
                              (org-agenda-log-mode-items '(closed clock state))
                              (org-agenda-start-day "-7d")
                              (org-agenda-entry-type '(:timestamp :sexp :deadline :sheduled))
                              (org-agenda-show-log t)))
                  (tags-todo "inbox")
                  (agenda "" ((org-agenda-span 31)))
                  ,(emagician-agenda/get-stuck-projects)
                  ,(emagician-agenda/get-tag "PROJECT" "📖 Projects")
                  ,(emagician-agenda/get-tag "FINISHED" "📘 Finished  ($ to archive)")
                  ,(emagician-agenda/get-tag "NEXT" "❇ Next Actions")
                  ,(emagician-agenda/get-tag "TODO" "🌱 TODO")
                  ,(emagician-agenda/get-tag "WAITING" "💬 Waiting")
                  ,(emagician-agenda/get-tag "FINISHED" "📘 Finished  ($ to archive)")
                  ,(emagician-agenda/get-tag "SOMEDAY" "🌞 Someday")
                  ,(emagician-agenda/get-tag "MAYBE" "🌠 Maybe")

  ))))
#+end_src
***  Display the started action

***  Display next actions for the context
*** PROJECT List all next actions on a keystroke (F4)
**** NEXT Org agenda command
**** TODO filter to work

** Make it convenient
*** Function to show the main agenda
#+begin_src emacs-lisp 
  (defun emagician-org/daily-agenda () 
    "Show the daily agenda"
    (interactive)
    (org-agenda nil " "))
#+end_src

*** Main agenda key
#+begin_src emacs-lisp 
(global-set-key (kbd "C-c a") 'emagician-org/daily-agenda)
(global-set-key (kbd "C-c A") 'org-agenda)
#+end_src

** Display the daily agenda on load 
This is temporarily deactivated.  Loading my agenda currently takes a long time. 

#+begin_src emacs-lisp :tangle no
(emagician/defhook open-agenda-and-swap-to-other-frame emacs-startup-hook 
  (emagician-org/daily-agenda)
  (other-frame 1))
#+end_src

* Exports 
#+begin_src emacs-lisp 
(require 'ox-beamer)
#+end_src

** Htmlize 
#+begin_src emacs-lisp 
(use-package htmlize)
#+end_src

* Plotting 
#+begin_src emacs-lisp 
(use-package gnuplot)
#+end_src

* Working with Code in Babel mode

#+begin_src emacs-lisp 
(setq org-src-tab-acts-natively t)
(setq org-src-fontify-natively t)
(setq org-edit-src-content-indentation 0)
#+end_src

** Languages

#+begin_src emacs-lisp 
(require 'ob-shell)
(require 'ob-sql)
(require 'ob-org)
#+end_src

#+begin_src emacs-lisp 
(org-babel-do-load-languages
 'org-babel-load-languages
 '((shell . t)
   (sql . t)
   (emacs-lisp . t)
   (org . t)
   ))
#+end_src



* Saving and auto Commiting

#+begin_src emacs-lisp 
(defun emagician-org/save-commit-and-push ()
  "Do the thing automagickally"
  (message "Autosaving buffers")
  (org-save-all-org-buffers)
  (with-helm-default-directory "~/org"
      (async-start
       (lambda ()
         (message "Commiting to git")
         (shell-command "git add *" "*org autocommit*" "*org autocommit*"))
       (lambda (result)
         (async-start
          (lambda ()
            (shell-command "git commit -m\"autpmagick commit\"" "*org autocommit*" "*org autocommit*"))
          'ignore)))))

(run-at-time t 600 'emagician-org/save-commit-and-push)
#+end_src

*** TODO fix this to use shell commands instead. 
*** Mobile Org

#+begin_src emacs-lisp 
(setq org-mobile-directory "~/Dropbox/org-mobile")
#+end_src

* Prettiness

#+begin_src emacs-lisp 
(defun turn-on-org-show-all-inline-images ()
  (org-display-inline-images t t))
(add-hook 'org-mode-hook 'turn-on-org-show-all-inline-images)
#+end_src
