Org-Grimoire.html
<div id="outline-container-org4ee24c5" class="outline-4">
<h4 id="org4ee24c5"><span class="section-number-4">17.11.1</span> set up a custom agenda with our sections</h4>
<div class="outline-text-4" id="text-17-11-1">
<pre class="code"><code>
      (<span class="org-keyword">setq</span> org-agenda-custom-commands
            `((<span class="org-string">" "</span> <span class="org-string">"Agenda"</span>
               ((emagician-agenda/insert-headline <span class="org-string">""</span>)
                ,(emagician-agenda/get-goals <span class="org-string">""</span>)
                (emagician-agenda/insert-cycle <span class="org-string">""</span>) 
                (agenda <span class="org-string">""</span> ((org-agenda-span 1) (org-agenda-show-log nil) ))
                ,(emagician-agenda/get-tag <span class="org-string">"STARTED"</span> <span class="org-string">"&#128165; Started"</span> t)
                ,(emagician-agenda/get-tag <span class="org-string">"WAITING"</span> <span class="org-string">"&#128172; Waiting"</span> t)
                ,(emagician-agenda/get-tag <span class="org-string">"NEXT"</span> <span class="org-string">"&#10055; Next Actions"</span> t)
                ,(emagician-agenda/get-stuck-projects))
               ((org-agenda-category-filter-preset '(<span class="org-string">"-Home"</span> <span class="org-string">"-Music"</span>))))
              (<span class="org-string">"W"</span> <span class="org-string">"Weekly Review"</span>
               ((emagician-agenda/insert-headline <span class="org-string">" Weekly Review "</span>)
                (agenda <span class="org-string">""</span> ((org-agenda-span 7)
                            (org-agenda-log-mode-items '(closed clock state))
                            (org-agenda-start-day <span class="org-string">"-7d"</span>)
                            (org-agenda-entry-type '(<span class="org-builtin">:timestamp</span> <span class="org-builtin">:sexp</span> <span class="org-builtin">:deadline</span> <span class="org-builtin">:sheduled</span>))
                            (org-agenda-show-log t)))
                (tags-todo <span class="org-string">"inbox"</span>)
                (agenda <span class="org-string">""</span> ((org-agenda-span 31)))
                ,(emagician-agenda/get-stuck-projects)
                ,(emagician-agenda/get-tag <span class="org-string">"PROJECT"</span> <span class="org-string">"&#128214; Projects"</span>)
                ,(emagician-agenda/get-tag <span class="org-string">"FINISHED"</span> <span class="org-string">"&#128216; Finished  ($ to archive)"</span>)
                ,(emagician-agenda/get-tag <span class="org-string">"NEXT"</span> <span class="org-string">"&#10055; Next Actions"</span>)
                ,(emagician-agenda/get-tag <span class="org-string">"TODO"</span> <span class="org-string">"&#127793; TODO"</span>)
                ,(emagician-agenda/get-tag <span class="org-string">"WAITING"</span> <span class="org-string">"&#128172; Waiting"</span>)
                ,(emagician-agenda/get-tag <span class="org-string">"FINISHED"</span> <span class="org-string">"&#128216; Finished  ($ to archive)"</span>)
                ,(emagician-agenda/get-tag <span class="org-string">"SOMEDAY"</span> <span class="org-string">"&#127774; Someday"</span>)
                ,(emagician-agenda/get-tag <span class="org-string">"MAYBE"</span> <span class="org-string">"&#127776; Maybe"</span>)

))))
</code></pre>
</div>
</div>
<div id="outline-container-org2543b2d" class="outline-4">
<h4 id="org2543b2d"><span class="section-number-4">17.11.2</span> Display the started action</h4>
</div>

<div id="outline-container-org9d264f3" class="outline-4">
<h4 id="org9d264f3"><span class="section-number-4">17.11.3</span> Display next actions for the context</h4>
</div>
<div id="outline-container-orgd2df5c1" class="outline-4">
<h4 id="orgd2df5c1"><span class="section-number-4">17.11.4</span> <span class="todo PROJECT">PROJECT</span> List all next actions on a keystroke (F4)</h4>
<div class="outline-text-4" id="text-17-11-4">
</div>
<div id="outline-container-org120688a" class="outline-5">
<h5 id="org120688a"><span class="section-number-5">17.11.4.1</span> <span class="todo NEXT">NEXT</span> Org agenda command</h5>
</div>
<div id="outline-container-org3f78d87" class="outline-5">
<h5 id="org3f78d87"><span class="section-number-5">17.11.4.2</span> <span class="todo TODO">TODO</span> filter to work</h5>
</div>
</div>
</div>

<div id="outline-container-orgf4875bb" class="outline-3">
<h3 id="orgf4875bb"><span class="section-number-3">17.12</span> Make it convenient</h3>
<div class="outline-text-3" id="text-17-12">
</div>
<div id="outline-container-org5589b95" class="outline-4">
<h4 id="org5589b95"><span class="section-number-4">17.12.1</span> Function to show the main agenda</h4>
<div class="outline-text-4" id="text-17-12-1">
<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">emagician-org/daily-agenda</span> () 
  <span class="org-doc">"Show the daily agenda"</span>
  (<span class="org-keyword">interactive</span>)
  (org-agenda nil <span class="org-string">" "</span>))
</code></pre>
</div>
</div>

<div id="outline-container-org5a4e233" class="outline-4">
<h4 id="org5a4e233"><span class="section-number-4">17.12.2</span> Main agenda key</h4>
<div class="outline-text-4" id="text-17-12-2">
<pre class="code"><code>(global-set-key (kbd <span class="org-string">"C-c a"</span>) 'emagician-org/daily-agenda)
(global-set-key (kbd <span class="org-string">"C-c A"</span>) 'org-agenda)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org1d87ceb" class="outline-3">
<h3 id="org1d87ceb"><span class="section-number-3">17.13</span> Display the daily agenda on load</h3>
<div class="outline-text-3" id="text-17-13">
<p>
This is temporarily deactivated.  Loading my agenda currently takes a long time. 
</p>

<pre class="code"><code>(<span class="org-keyword">emagician/defhook</span> open-agenda-and-swap-to-other-frame emacs-startup-hook 
  (emagician-org/daily-agenda)
  (other-frame 1))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgda4e47e" class="outline-2">
<h2 id="orgda4e47e"><span class="section-number-2">18</span> Exports</h2>
<div class="outline-text-2" id="text-18">
<pre class="code"><code>(<span class="org-keyword">require</span> '<span class="org-constant">ox-beamer</span>)
</code></pre>
</div>

<div id="outline-container-orgab913f0" class="outline-3">
<h3 id="orgab913f0"><span class="section-number-3">18.1</span> Htmlize</h3>
<div class="outline-text-3" id="text-18-1">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">htmlize</span>)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org0870173" class="outline-2">
<h2 id="org0870173"><span class="section-number-2">19</span> Plotting</h2>
<div class="outline-text-2" id="text-19">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">gnuplot</span>)
</code></pre>
</div>
</div>

<div id="outline-container-org795268b" class="outline-2">
<h2 id="org795268b"><span class="section-number-2">20</span> Working with Code in Babel mode</h2>
<div class="outline-text-2" id="text-20">
<pre class="code"><code>(<span class="org-keyword">setq</span> org-src-tab-acts-natively t)
(<span class="org-keyword">setq</span> org-src-fontify-natively t)
(<span class="org-keyword">setq</span> org-edit-src-content-indentation 0)
</code></pre>
</div>

<div id="outline-container-org9a8788d" class="outline-3">
<h3 id="org9a8788d"><span class="section-number-3">20.1</span> Languages</h3>
<div class="outline-text-3" id="text-20-1">
<pre class="code"><code>(<span class="org-keyword">require</span> '<span class="org-constant">ob-shell</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">ob-sql</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">ob-org</span>)
</code></pre>

<pre class="code"><code>(org-babel-do-load-languages
 'org-babel-load-languages
 '((shell . t)
   (sql . t)
   (emacs-lisp . t)
   (org . t)
   ))
</code></pre>
</div>
</div>
</div>



<div id="outline-container-org1f8dc24" class="outline-2">
<h2 id="org1f8dc24"><span class="section-number-2">21</span> Saving and auto Commiting</h2>
<div class="outline-text-2" id="text-21">
<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">emagician-org/save-commit-and-push</span> ()
  <span class="org-doc">"Do the thing automagickally"</span>
  (message <span class="org-string">"Autosaving buffers"</span>)
  (org-save-all-org-buffers)
  (<span class="org-keyword">with-helm-default-directory</span> <span class="org-string">"~/org"</span>
      (async-start
       (<span class="org-keyword">lambda</span> ()
         (message <span class="org-string">"Commiting to git"</span>)
         (shell-command <span class="org-string">"git add *"</span> <span class="org-string">"*org autocommit*"</span> <span class="org-string">"*org autocommit*"</span>))
       (<span class="org-keyword">lambda</span> (result)
         (async-start
          (<span class="org-keyword">lambda</span> ()
            (shell-command <span class="org-string">"git commit -m\"autpmagick commit\""</span> <span class="org-string">"*org autocommit*"</span> <span class="org-string">"*org autocommit*"</span>))
          'ignore)))))

(run-at-time t 600 'emagician-org/save-commit-and-push)
</code></pre>
</div>

<div id="outline-container-org550abd4" class="outline-4">
<h4 id="org550abd4"><span class="section-number-4">21.0.1</span> <span class="todo TODO">TODO</span> fix this to use shell commands instead.</h4>
</div>
<div id="outline-container-org8d261bb" class="outline-4">
<h4 id="org8d261bb"><span class="section-number-4">21.0.2</span> Mobile Org</h4>
<div class="outline-text-4" id="text-21-0-2">
<pre class="code"><code>(<span class="org-keyword">setq</span> org-mobile-directory <span class="org-string">"~/Dropbox/org-mobile"</span>)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org038da8a" class="outline-2">
<h2 id="org038da8a"><span class="section-number-2">22</span> Prettiness</h2>
<div class="outline-text-2" id="text-22">
<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">turn-on-org-show-all-inline-images</span> ()
  (org-display-inline-images t t))
(add-hook 'org-mode-hook 'turn-on-org-show-all-inline-images)
</code></pre>
</div>
</div>
